// services-communicate.component.ts
import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';
import { CartService } from '../cart.service';

@Component({
  selector: 'app-services-communicate',
  standalone: false,
  templateUrl: './services-communicate.component.html',
  styleUrl: './services-communicate.component.css'
})
export class ServicesCommunicateComponent implements OnInit {
  openIndex: number | null = null;

  accordionItems = [
    {
      title: 'ხელოვნების ნიმუშების შეძენა',
      img: 'https://artonline24.ru/upload/iblock/0b7/3i0sh4jo5v3pfjt54igdnyf0xue3s4tr.svg',
      content: 'ჩვენს გალერეაში "Plankton" შეგიძლიათ შეიძინოთ ონლაინ, გადაიხადოთ მიღებისთანავე ან პირდაპირ გალერეაში თანამედროვე მხატვრებისა და მოქანდაკეების ფერწერა, გრაფიკა, ქანდაკება და ფოტოგრაფია, რომლებიც მუშაობენ როგორც თანამედროვე, ასევე კლასიკურ სტილში. ჩვენი კატალოგი წარმოგიდგენთ ხელოვნების ნიმუშებს ყველა სტილში - რეალიზმიდან, იმპრესიონიზმიდან, მოდერნიზმიდან და სიურეალიზმიდან დაწყებული პოპ-არტით, აბსტრაქტული ხელოვნებით, ჰიპერრეალიზმით, თანამედროვე ხელოვნებითა და სხვა ტენდენციებით დამთავრებული. მიწოდების განყოფილებაში შეგიძლიათ აირჩიოთ თქვენთვის ყველაზე მოსახერხებელი გზა თქვენი შენაძენის მისაღებად.'
    },
    {
      title: 'ხელოვნების ნიმუშების შერჩევა',
      img: 'https://artonline24.ru/upload/iblock/0dc/vfl5tmqq6rv8mmu51z9bq5ok0rwn3cz1.svg',
      content: 'გალერეა „Plankton"-თან თანამშრომლობით პროფესიონალი კურატორები დაგეხმარებიან კერძო ან კორპორატიული კოლექციის ფორმირებაში, ასევე კერძო ინტერიერების, საზოგადოებრივი სივრცეებისა და ოფისების გასაფორმებლად ხელოვნების ნიმუშების შერჩევაში. შეგიძლიათ გამოგვიგზავნოთ ინტერიერის ფოტოები ან დანიშნოთ პირადი შეხვედრა თქვენთვის მოსახერხებელ დროს და ჩვენ შევარჩევთ თქვენთვის საუკეთესო ნამუშევრებს.'
    },
    {
      title: 'ნახატებისა და გრაფიკის ჩარჩოებში ჩასმა',
      img: 'https://artonline24.ru/upload/iblock/3f3/1rtdlupddv7acuo4z41h213km7ec5fn4.svg',
      content: 'ჩვენთან შეგიძლიათ შეუკვეთოთ შეძენილი ნამუშევრების პროფესიონალური ჩარჩოები, მათ შორის ისეთი ნამუშევრები, რომლებიც პირდაპირ შეესაბამება თქვენი სახლის სტილს. შეგიძლიათ გამოგვიგზავნოთ იმ ინტერიერის ფოტოები, რომელშიც ნამუშევრები განთავსდება, ან შეუკვეთოთ ვიზიტი ჩვენი სპეციალისტისგან და ჩვენ შეგირჩევთ საუკეთესო დიზაინს.'
    },
    {
      title: 'ჩამოკიდება, განათება და ტრანსპორტირება',
      img: 'https://artonline24.ru/upload/iblock/f42/d7kuhrxxr46116ew2sbi4gnpkg9csd31.svg',
      content: 'ჩვენი გალერეა ასევე გთავაზობთ ნახატების პროფესიონალურ ჩამოკიდებისა და განათების მომსახურებას, საჭიროების შემთხვევაში კი, შეფუთვისა და ტრანსპორტირების სამუშაოებს, მხოლოდ სპეციალიზებული კომპანიების გამოყენებით, რომლებსაც აქვთ მუზეუმის გამოფენებთან და ექსპონატებთან მუშაობის დიდი გამოცდილება. დაგვიკავშირდით, რათა დაგეგმოთ სპეციალისტის ვიზიტი თქვენთვის მოსახერხებელ დროს.'
    },
    {
      title: 'ინდივიდუალური ნამუშევრების შექმნა და რეპლიკების დამზადება',
      img: 'https://artonline24.ru/upload/iblock/cc9/d3a2nd4asnni3whr5hq26kyw05l7ar53.svg',
      content: 'ჩვენთან თქვენ შეგიძლიათ არა მხოლოდ შეიძინოთ თქვენთვის სასურველი ნამუშევარი ონლაინ გალერეაში, არამედ შეუკვეთოთ: თქვენი საყვარელი ნახატის ან ჩვენი კატალოგიდან ნამუშევრის ანაბეჭდის ასლი; ფოტოს ავტორის ან გამოცემის ასლი; მხატვრული ან ფოტოპორტრეტი; ნებისმიერი ხელოვნების ნიმუში თქვენი სურვილის შესაბამისად - პეიზაჟებიდან და ქანდაკებებიდან დაწყებული ინტერიერის მხატვრობის მონუმენტურ ნამუშევრებამდე. თქვენ მხოლოდ უნდა გამოაგზავნოთ ბმული იმ ნამუშევარზე, რომელმაც შთაგაგონათ ელექტრონული ფოსტით და ჩვენ შეგირჩევთ ავტორს, რომლის შესრულების სტილიც ყველაზე ახლოს იქნება თქვენთან.'
    },
    {
      title: 'მიწოდება',
      img: 'https://artonline24.ru/upload/iblock/72b/je3zc81cm3gn8iwsi5vevw7vo0mkv86t.svg',
      content: 'საჭიროა ზუსტი ინფორმაცია !!!!!!!'
    },
    {
      title: 'მიწოდება გალერეაში',
      img: 'https://artonline24.ru/upload/iblock/3e2/sjtundcjd412jt0yrbaibo5zd6yz7ybv.svg',
      content: 'საჭიროა ზუსტი ინფორმაცია !!!!!!!'
    },
    {
      title: 'მოსინჯვა',
      img: 'https://artonline24.ru/upload/iblock/286/bo3hvi0bw9aelwybfnvndfh2ojri2sno.svg',
      content: 'საჭიროა ზუსტი ინფორმაცია !!!!!!!'
    }
  ];

  collaborationItems = [
    {
      title: 'მხატვრებს',
      img: null,
      content: 'Plankton.ge თანამედროვე ხელოვნების გაყიდვების უდიდესი ონლაინ პლატფორმაა საქართველოში. ჩვენ დიდ ყურადღებას ვაქცევთ ავტორების ფრთხილად შერჩევას და ვამაყობთ ჩვენი მხატვრებით. ჩვენთან თანამშრომლობით, შეგიძლიათ დარწმუნებული იყოთ, რომ თქვენი ნამუშევრები წარმოდგენილი იქნება ღირსეულ გარემოში და ჩვენი კურატორები ყველაფერს გააკეთებენ იმისათვის, რომ გალერეის კლიენტებმა მათ დიდი ყურადღება მიაქციონ. თუ გსურთ თქვენი პორტფოლიოს წარდგენა, გამოაგზავნეთ ის ელექტრონულად ან დაგვიკავშირდით ელექტრონული ფოსტით ან ტელეფონით +995 555-976-925 პირადი შეხვედრის დასანიშნად.'
    },
    {
      title: 'ინტერიერის დიზაინერებს',
      img: null,
      content: 'ჩვენს კურატორებს უნიკალური გამოცდილება აქვთ როგორც ხელოვნების, ასევე ინტერიერის დიზაინის სფეროში. ჩვენ სიამოვნებით დაგეხმარებით თქვენი პროექტებისთვის ნამუშევრების შერჩევაში და ასევე უზრუნველვყოფთ ნამუშევრების პროფესიონალურ დიზაინს, მიწოდებას, ჩამოკიდებას და განათებას. ჩვენი კურატორები მზად არიან შეარჩიონ ნამუშევრები თქვენი ინტერიერისთვის პროექტის, ფოტოგრაფიის ან თქვენთვის მოსახერხებელ დროს ადგილზე ვიზიტის საფუძველზე. გარდა ამისა, ჩვენ ვთანამშრომლობთ მონუმენტურ მხატვრებთან, რომელთაგანაც შეგიძლიათ შეუკვეთოთ ინტერიერის მოხატვა. შეგიძლიათ დაგვიკავშირდეთ ტელეფონით +995 555-976-925 ან პირდაპირ ჩვენს გალერეაში.'
    },
    {
      title: 'პარტნიორებს',
      img: null,
      content: 'თანამშრომლობისთვის ვიწვევთ ხელოვნების ნიმუშების ჩამოკიდების, განათების, ჩარჩოების დამზადებისა და რესტავრაციის სპეციალისტებს, ასევე სპეციალიზებულ სატრანსპორტო კომპანიებსა და ფოტოლაბორატორიებს ხელოვნების ნიმუშების ბეჭდვისთვის. გამოგვიგზავნეთ თქვენი წინადადება ელექტრონული ფოსტით და ჩვენ აუცილებლად დაგიკავშირდებით.'
    },
    {
      title: 'გალერეებს',
      img: null,
      content: 'ონლაინ გალერეა Planktion.ge ასევე მუშაობს როგორც ხელოვნების გალერეების პორტალი. თუ დამოუკიდებელი ონლაინ გაყიდვები თქვენი გალერეისთვის პრიორიტეტს არ წარმოადგენს, რადგან ისინი დამატებით ინვესტიციებსა და სპეციალისტებს საჭიროებენ, ან თქვენ სხვა ქალაქში იმყოფებით, ჩვენ სიამოვნებით შემოგთავაზებთ ჩვენს ონლაინ გაყიდვების შესაძლებლობებს. ჩვენი ფართო კავშირები კოლექციონერებთან და ინტერიერის დიზაინერებთან ხელოვნების ნიმუშების გაყიდვის ახალ შესაძლებლობებს მოგცემთ. ჩვენ ყურადღებით ვარჩევთ ჩვენს პარტნიორ გალერეებს და გარანტიას გაძლევთ, რომ თქვენი ექსკლუზიურობა დაცული იქნება მხატვრების პორტფოლიოებთან მუშაობისას. თუ გსურთ თქვენი გალერეის პორტფოლიოს წარდგენა, გთხოვთ, გამოაგზავნოთ იგი ელექტრონულად ან დაგვიკავშირდეთ ელექტრონული ფოსტით ან ტელეფონით +995 555-976-925 ნომერზე პირადი შეხვედრის დასანიშნად.'
    }
  ];

  constructor(private router: Router, private cartService: CartService) { }

  ngOnInit() { }

  toggleAccordion(index: number) {
    this.openIndex = this.openIndex === index ? null : index;
  }

  isOpen(index: number): boolean {
    return this.openIndex === index;
  }
}